read_verilog ./examples/s9234.v
hierarchy -check -top s9234
proc; opt; fsm; opt; memory; opt
techmap; opt
flatten;
abc -g gates,MUX
clean -purge
write_json ./build/examples/s9234.json
