read_verilog ../Buntan/examples/FA.v
hierarchy -check -top FA
proc; opt; fsm; opt; memory; opt
techmap; opt
flatten;
abc -g gates,MUX
clean -purge
write_json FA.json
