# read design 
read -sv FF_ex.v

# elaborate design hierarchy
hierarchy -check -top top

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping logic to gates.
abc -g gates,MUX,NMUX

# Extract Full/Half Adder. Order is important.
# extract_fa

# cleanup
clean -purge

# write synthesized design
write_json FF_ex.json

# Print statistics
stat

#check output circuit
show
